[
  {
    "title": "ONECONFIG UPDATE 0.2 - \"UI Tweaks\"",
    "short": "Hey everyone, it's been a bit since the last OneConfig update, which is in open beta if you haven't seen all the memes. Nevertheless, here we are announcing the very first update to OneConfig. It's a smaller one, but contains a lot of the features you all have been asking for. If you haven't already, shoddy made a great video explaining how to download OneConfig, find it here: https://youtu.be/dfv_1s70wGI\n\n**What's new?**\n- OneConfig now supports your Hypixel API Keys! You can set and sync your key across all supported mods.\n- Sliders now have interaction states, and stepped sliders now only show their steps when hovered or pressed.\n- All searches now utilize fuzzy searching to combat spelling mistakes and misclicks\n- Options now display what's disabling them when hovered over\n- Many UI/UX features and behaviors can now be customized to your hearts content",
    "big": "Hey everyone, it's been a bit since the last OneConfig update, which is in open beta if you haven't seen all the memes. Nevertheless, here we are announcing the very first update to OneConfig. It's a smaller one, but contains a lot of the features you all have been asking for. If you haven't already, shoddy made a great video explaining how to download OneConfig, find it here: https://youtu.be/dfv_1s70wGI\n\n**What's new?**\n- OneConfig now supports your Hypixel API Keys! You can set and sync your key across all supported mods.\n- Sliders now have interaction states, and stepped sliders now only show their steps when hovered or pressed.\n- All searches now utilize fuzzy searching to combat spelling mistakes and misclicks\n- Options now display what's disabling them when hovered over\n- Many UI/UX features and behaviors can now be customized to your hearts content\n\n**Full changelog:**\n\n**Sliders**\n- Sliders now have different animated states for when you’re hovered or pressing them\n- Stepped sliders now only show their steps when hovered/pressed.\n\n**New animations**\n- Added a new open / closing animation with both Subtle and Full modes.\n- Many animations can now be configured in the OneConfig settings\n\n**Fuzzy searching**\n- Added fuzzy searching for all searchable menus\n\n**Hypixel API Keys**\n- OneConfig now supports syncing your API keys with Hypixel.\n- When you join Hypixel with a mod that requires an API key, OneConfig will suggest you create a new one, and sync it\n\n**User experience edits**\n- You can now modify the behavior when you open OneConfig. Configure it to return you to where you left off, to mods page, or a mix of the two\n- Page navigation has also improved. You can now use your L/R arrow keys. Previous pages are also now saved when you navigate with the titlebar.\n- The OneConfig preferences has a new layout\n- Options now show what's disabling them\n\n**UI-Tweaks**\n- Descriptions now have a slight border\n- In-gui notifications have been added for internal use\n- The sidebar and search bar now have new/edited icons and colors\n- Text inputs have been altered with new icons & smaller borders, amd reduced font size\n- Color settings no longer have inline HEX & Alpha text-inputs\n- Outside UI border removed\n- Page animations can be toggled & animation speed can be modified\n- Toggle button bounce can be toggled\n- Slider response time can be edited\n\n**Bug fixes**\n- Searching now displays all categories, not just your current one\n- Previous pages are now updated when the title navigation is used\n- Pre-release channel works again",
    "image": "https://cdn.discordapp.com/attachments/822067772489072640/1063252743722115092/onecfg_0.2_banner-discord.png",
    "date": 1673485757,
    "author": "Caledonian"
  },
  {
    "title": "OneCore Maintenance Update",
    "big": "**MAINTENANCE IS TAKING PLACE ON ONECORE, AND THUS SOME MODS WON'T WORK!**\n\nWe are aware of this issue and currently working to resolve it. Please be patient while we work though this. Thanks!\n\nUpdate: We are aware of this issue and are awaiting to verify results. Please keep in mind that OneCore is on legacy maintenance and will eventually reach its EOL very soon.",
    "date": 1648861757
  },
  {
    "title": "What does 'k' mean? And why we only have one of them?",
    "big": "Seriously, THANK YOU everyone, for your support not just in these past few days, but the weeks and months prior. Every community has some pretty big milestones, the first hundred, five hundred, but one thousand is probably the most important of all. We won't give you all a boring history lecture, or cry about how far we've come, but we will show our appreciation to everyone who's helped made this possible. Our moderators, contributors, the current and past team members, especially Diamond and Moon. So many people with so many ideas and so many passions have put so much time into this project, just-- thank you. I've never been in a better community before. Alright that's enough of this, let's get into the good stuff. What's coming next?\n\n**ONECONFIG**\nWe've basically finished the first major OneConfig update, which is going to include many UI/UX improvements, and a few highly requested features. We actually read your suggestions, so please post anything you'd like to see. Some of these features have been pushed to the pre-release branch for a while now, but there's still more to come. Maybe even in a day or two! Looking further beyond, we plan to support more Minecraft versions in the near future, and add even more options and features. Lots to come!\n\n**POLYUI**\nSo we haven't talked much about this yet, but it's basically the key to all of our future projects. We've learned a lot about UIs and design systems since the start of OneConfig, and it's about time we build our own UI engine. We won't get into the boring details, but it'll be used for both or JVM and Web projects, and be the tool that allows us to rapidly produce new features and updates. (its blazingly fast memory safe)\n\n**ONELAUNCHER**\nThere still isn't a lot to publically say yet. A lot of progress has been made on the backend, but designs haven't been locked in yet, and we've still got a long way to do. (This idiot cal won't just give the design). Not much has been leaked yet because it's basically a bunch of cli, yuck boring. Once designs start coming out we'll be sharing everything that is being worked on.\n\nThank you once again for 1k! alr bai",
    "image": "https://cdn.discordapp.com/attachments/822067772489072640/1061865558968127518/polyfrost_1k-banner.png",
    "date": 1641063737,
    "author": "Caledonian"
  }
]
